tutorials/lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/constant/kinematicCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        U
        {
            semiImplicit    false;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
    }

    integrationSchemes
    {
        U               Euler;
    }
}

constantProperties
{
    parcelTypeId    2;

    rhoMin          1e-15;
    minParticleMass 1e-15;

    rho0            5000;

    youngsModulus   1e9;
    poissonsRatio   0.35;
}

particleForces
{
    gravity             on;
    virtualMass         off;
    pressureGradient    off;
    paramagnetic        off;
}

subModels
{
    InjectionModel  ManualInjection;

    DragModel       SphereDrag;

    DispersionModel StochasticDispersionRAS;

    PatchInteractionModel StandardWallInteraction;

    PostProcessingModel none;

    SurfaceFilmModel none;

    CollisionModel none;

    ManualInjectionCoeffs
    {
        massTotal       0.0002;
        parcelBasisType mass;
        SOI             0;
        positionsFile   "kinematicCloud1Positions";
        U0              ( 0 0 0 );
        parcelPDF
        {
            pdfType         RosinRammler;
            RosinRammlerPDF
            {
                minValue        5e-05;
                maxValue        0.0001;
                d               7.5e-05;
                n               0.5;
            }
        }
    }

    StandardWallInteractionCoeffs
    {
        type            rebound;
    }
}


// ************************************************************************* //
